import { LyricParser, LyricPlayer } from '../src'

const parser = new LyricParser()

const result = parser.parseLyric({
  original: `
  [00:00.0]天空没有极限 - G.E.M.邓紫棋
  [00:14.881]当我好奇地乱敲着黑白的琴键
  [00:18.619]当我躲在房间乐极忘形地表演
  [00:22.19]你微笑的双眼  是否当时早有预感
  [00:27.104]看到了今天
  [00:29.341]当我没日没夜听着最爱的唱片
  [00:32.919]当我书本每一页都画满了和弦
  [00:36.356]你从不曾熄灭  我天真的火焰
  [00:39.841]不怪我在浪费时间
  [00:44.641]是你的无条件  成就了这一切
  [00:51.809]是你让我看见
  [00:55.276]天空没有极限  我的未来无边
  [01:02.481]破茧的我会飞向更蔚蓝的明天
  [01:09.537]前方路若遥远  回头看看从前
  [01:16.705]看看镜子里的你带着曾经的我
  [01:24.513]已走了多远
  [01:28.353]多少次我心里浮现失控的画面
  [01:31.965]多少冷言冷语汹涌地来到耳边
  [01:35.599]多少夜失眠  你是否也曾度日如年
  [01:40.512]差一点沦陷
  [01:42.793]当我落寞地遥望着再来的春天
  [01:46.401]当我默默地把眼泪流在心里面
  [01:49.925]当一切违愿  谁不曾埋怨
  [01:54.452]进退都在一念间
  [01:58.49]但你却无条件  扛下了这一切
  [02:05.281]是你让我看见
  [02:08.859]天空没有极限  我的未来无边
  [02:15.892]破茧的我会飞向更蔚蓝的明天
  [02:22.945]前方路若遥远  回头看看从前
  [02:30.113]看看镜子里的你带着曾经的我
  [02:38.177]已走了多远
  [02:45.409]走了多远  多远  有多远  有多远
  [03:09.537]看看从前  我已走了多远
  [03:23.681]我的世界  我看不到边界
  [03:38.471]天空没有极限  我的未来无边
  [03:43.797]破茧的我会飞向更蔚蓝的明天
  [03:49.99]前方路若遥远  回头看看从前
  [03:56.293]看看镜子里的你带着曾经的我
  [04:04.266]已走了多远
  [04:05.537]多少次我心里浮现失控的画面
  [04:09.548]多少冷言冷语汹涌地来到耳边
  [04:13.343]多少夜失眠  你是否也曾度日如年
  [04:18.87]差一点沦陷
  [04:20.346]当我落寞地遥望着再来的春天
  [04:23.863]当我默默地把眼泪流在心里面
  [04:27.580]当一切违愿  抬头看看蓝天
  [04:32.584]没有极限
  `,
})

const player = new LyricPlayer({
  lyricInfo: result,
  onSetLyric(info) {
    console.log('onSetLyric', info)
  },
  onPlay(line, info) {
    console.log('onPlay', line, info)
  },
})

player.play()
